#+TITLE: Match IP to IP range

** Deploying
#+begin_src shell :noweb yes
kubectl apply -f - << EOF
<<postgres-secret>>
---
<<postgres-deployment>>
EOF
#+end_src

#+RESULTS:
#+begin_example
secret/postgres-configuration created
persistentvolumeclaim/postgres-pvc created
statefulset.apps/postgres created
service/postgres created
#+end_example

** usage_all_ip_only_distinct_int
Copy data to a CSV file in a bucket
#+begin_src shell :prologue "( " :epilogue " ) 2>&1 ; :"
TIMESTAMP=$(date +%Y%m%d%H%M)
echo $TIMESTAMP > /tmp/k8s_artifacts_dataset_bb_test.usage_all_ip_only_distinct_int-timestamp.txt

bq extract \
    --destination_format CSV \
    k8s-infra-ii-sandbox:k8s_artifacts_dataset_bb_test.usage_all_ip_only_distinct_int \
    gs://ii_bq_scratch_dump/k8s_artifacts_dataset_bb_test.usage_all_ip_only_distinct_int-$TIMESTAMP-*.csv
#+end_src

#+RESULTS:
#+begin_example
Waiting on bqjob_r2d928ae00ed33f93_00000179ee76495d_1 ... (0s) Current status: RUNNING                                                                                      Waiting on bqjob_r2d928ae00ed33f93_00000179ee76495d_1 ... (1s) Current status: RUNNING                                                                                      Waiting on bqjob_r2d928ae00ed33f93_00000179ee76495d_1 ... (2s) Current status: RUNNING                                                                                      Waiting on bqjob_r2d928ae00ed33f93_00000179ee76495d_1 ... (3s) Current status: RUNNING                                                                                      Waiting on bqjob_r2d928ae00ed33f93_00000179ee76495d_1 ... (4s) Current status: RUNNING                                                                                      Waiting on bqjob_r2d928ae00ed33f93_00000179ee76495d_1 ... (5s) Current status: RUNNING                                                                                      Waiting on bqjob_r2d928ae00ed33f93_00000179ee76495d_1 ... (6s) Current status: RUNNING                                                                                      Waiting on bqjob_r2d928ae00ed33f93_00000179ee76495d_1 ... (7s) Current status: RUNNING                                                                                      Waiting on bqjob_r2d928ae00ed33f93_00000179ee76495d_1 ... (7s) Current status: DONE
#+end_example

List csv files
#+begin_src shell
TIMESTAMP=$(cat /tmp/k8s_artifacts_dataset_bb_test.usage_all_ip_only_distinct_int-timestamp.txt | tr -d '\n')
gsutil ls gs://ii_bq_scratch_dump/k8s_artifacts_dataset_bb_test.usage_all_ip_only_distinct_int-$TIMESTAMP-*.csv | head
echo "..."
printf "Total: "
gsutil ls gs://ii_bq_scratch_dump/k8s_artifacts_dataset_bb_test.usage_all_ip_only_distinct_int-$TIMESTAMP-*.csv | wc -l
#+end_src

#+RESULTS:
#+begin_example
gs://ii_bq_scratch_dump/k8s_artifacts_dataset_bb_test.usage_all_ip_only_distinct_int-202106091349-000000000000.csv
...
Total: 1
#+end_example

Download data
#+begin_src tmate :window prepare
TIMESTAMP=$(cat /tmp/k8s_artifacts_dataset_bb_test.usage_all_ip_only_distinct_int-timestamp.txt | tr -d '\n')
mkdir -p /tmp/usage_all_ip_only/
gsutil cp \
    gs://ii_bq_scratch_dump/k8s_artifacts_dataset_bb_test.usage_all_ip_only_distinct_int-$TIMESTAMP-*.csv \
    /tmp/usage_all_ip_only/
#+end_src

#+RESULTS:
#+begin_example
#+end_example

Merge the data
#+begin_src tmate :window prepare
cat /tmp/usage_all_ip_only/*.csv | tail +2 > /tmp/usage_all_ip_only.csv
#+end_src

** shadow_pyasn_expanded
Copy data to a CSV file in a bucket
#+begin_src shell :prologue "( " :epilogue " ) 2>&1 ; :"
TIMESTAMP=$(date +%Y%m%d%H%M)
echo $TIMESTAMP > /tmp/k8s_artifacts_dataset_bb_test.shadow_pyasn_expanded-timestamp.txt

bq extract \
    --destination_format CSV \
    k8s-infra-ii-sandbox:k8s_artifacts_dataset_bb_test.shadow_pyasn_expanded \
    gs://ii_bq_scratch_dump/k8s_artifacts_dataset_bb_test.shadow_pyasn_expanded-$TIMESTAMP-*.csv
#+end_src

#+RESULTS:
#+begin_example
Waiting on bqjob_r7cc7240d1c424b28_00000179ee8da14d_1 ... (0s) Current status: RUNNING                                                                                      Waiting on bqjob_r7cc7240d1c424b28_00000179ee8da14d_1 ... (1s) Current status: RUNNING                                                                                      Waiting on bqjob_r7cc7240d1c424b28_00000179ee8da14d_1 ... (2s) Current status: RUNNING                                                                                      Waiting on bqjob_r7cc7240d1c424b28_00000179ee8da14d_1 ... (3s) Current status: RUNNING                                                                                      Waiting on bqjob_r7cc7240d1c424b28_00000179ee8da14d_1 ... (4s) Current status: RUNNING                                                                                      Waiting on bqjob_r7cc7240d1c424b28_00000179ee8da14d_1 ... (5s) Current status: RUNNING                                                                                      Waiting on bqjob_r7cc7240d1c424b28_00000179ee8da14d_1 ... (5s) Current status: DONE
#+end_example

List csv files
#+begin_src shell
TIMESTAMP=$(cat /tmp/k8s_artifacts_dataset_bb_test.shadow_pyasn_expanded-timestamp.txt | tr -d '\n')
gsutil ls gs://ii_bq_scratch_dump/k8s_artifacts_dataset_bb_test.shadow_pyasn_expanded-$TIMESTAMP-*.csv | head
echo "..."
printf "Total: "
gsutil ls gs://ii_bq_scratch_dump/k8s_artifacts_dataset_bb_test.shadow_pyasn_expanded-$TIMESTAMP-*.csv | wc -l
#+end_src

#+RESULTS:
#+begin_example
gs://ii_bq_scratch_dump/k8s_artifacts_dataset_bb_test.shadow_pyasn_expanded-202106091415-000000000000.csv
...
Total: 1
#+end_example

Download data
#+begin_src tmate :window prepare
TIMESTAMP=$(cat /tmp/k8s_artifacts_dataset_bb_test.shadow_pyasn_expanded-timestamp.txt | tr -d '\n')
mkdir -p /tmp/shadow_pyasn_expanded/
gsutil cp \
    gs://ii_bq_scratch_dump/k8s_artifacts_dataset_bb_test.shadow_pyasn_expanded-$TIMESTAMP-*.csv \
    /tmp/shadow_pyasn_expanded/
#+end_src

#+RESULTS:
#+begin_example
#+end_example

Merge the data
#+begin_src tmate :window prepare
cat /tmp/shadow_pyasn_expanded/*.csv | tail +2 > /tmp/shadow_pyasn_expanded.csv
#+end_src

